# Data Cleaning and Preparation

In [4]:
import numpy as np
import pandas as pd
PREVIOUS_MAX_ROWS = pd.options.display.max_rows
pd.options.display.max_rows = 20
np.random.seed(12345)
import matplotlib.pyplot as plt
plt.rc('figure', figsize=(10, 6))
np.set_printoptions(precision=4, suppress=True)

## Handling Missing Data

In [10]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
print(string_data)
string_data.isnull()

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

0    False
1    False
2     True
3    False
dtype: bool

In [11]:
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

### Filtering Out Missing Data

In [14]:
from numpy import nan as NA
data = pd.Series([1, NA, 3.5, NA, 7])
print(data)
data.dropna()

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

0    1.0
2    3.5
4    7.0
dtype: float64

In [15]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [16]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                     [NA, NA, NA], [NA, 6.5, 3.]])
cleaned = data.dropna()
data
cleaned

     0    1    2
0  1.0  6.5  3.0

In [17]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [20]:
data[4] = NA
data
print(data)
data.dropna(axis=1, how='all')

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [30]:
df = pd.DataFrame(np.random.randn(7, 3))
print(df)
df.iloc[:4, 1] = NA
print(df)
df.iloc[:2, 2] = NA
df
print(df)
df.dropna()
df.dropna(thresh=2)

          0         1         2
0 -0.289436 -0.734297 -0.728505
1  0.838775  0.266893  0.721194
2  0.910983 -1.020903 -1.413416
3  1.296608  0.252275  1.127481
4 -0.568363  0.309362 -0.577385
5 -1.168634 -0.825020 -2.644409
6 -0.152986 -0.751921 -0.132609
          0         1         2
0 -0.289436       NaN -0.728505
1  0.838775       NaN  0.721194
2  0.910983       NaN -1.413416
3  1.296608       NaN  1.127481
4 -0.568363  0.309362 -0.577385
5 -1.168634 -0.825020 -2.644409
6 -0.152986 -0.751921 -0.132609
          0         1         2
0 -0.289436       NaN       NaN
1  0.838775       NaN       NaN
2  0.910983       NaN -1.413416
3  1.296608       NaN  1.127481
4 -0.568363  0.309362 -0.577385
5 -1.168634 -0.825020 -2.644409
6 -0.152986 -0.751921 -0.132609

          0         1         2
2  0.910983       NaN -1.413416
3  1.296608       NaN  1.127481
4 -0.568363  0.309362 -0.577385
5 -1.168634 -0.825020 -2.644409
6 -0.152986 -0.751921 -0.132609

### Filling In Missing Data

In [31]:
df.fillna(0)

          0         1         2
0 -0.289436  0.000000  0.000000
1  0.838775  0.000000  0.000000
2  0.910983  0.000000 -1.413416
3  1.296608  0.000000  1.127481
4 -0.568363  0.309362 -0.577385
5 -1.168634 -0.825020 -2.644409
6 -0.152986 -0.751921 -0.132609

In [32]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0 -0.289436  0.500000  0.000000
1  0.838775  0.500000  0.000000
2  0.910983  0.500000 -1.413416
3  1.296608  0.500000  1.127481
4 -0.568363  0.309362 -0.577385
5 -1.168634 -0.825020 -2.644409
6 -0.152986 -0.751921 -0.132609

In [33]:
_ = df.fillna(0, inplace=True)
df

          0         1         2
0 -0.289436  0.000000  0.000000
1  0.838775  0.000000  0.000000
2  0.910983  0.000000 -1.413416
3  1.296608  0.000000  1.127481
4 -0.568363  0.309362 -0.577385
5 -1.168634 -0.825020 -2.644409
6 -0.152986 -0.751921 -0.132609

In [34]:
df = pd.DataFrame(np.random.randn(6, 3))
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA
df
df.fillna(method='ffill')
df.fillna(method='ffill', limit=2)

          0         1         2
0  1.457300  0.609512 -0.493779
1  1.239980 -0.135722  1.430042
2 -0.846852 -0.135722  1.263572
3 -0.255491 -0.135722  0.468367
4 -0.961604       NaN  0.468367
5  1.022872       NaN  0.468367

In [35]:
data = pd.Series([1., NA, 3.5, NA, 7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

## Data Transformation

### Removing Duplicates

In [36]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                     'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [37]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [38]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [45]:
data['v1'] = range(7)
print(data)
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

    k1  k2  v1
0  one   1   0
1  two   1   1

In [47]:
print(data)
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

### Transforming Data Using a Function or Mapping

In [48]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                              'Pastrami', 'corned beef', 'Bacon',
                              'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [49]:
meat_to_animal = {
  'bacon': 'pig',
  'pulled pork': 'pig',
  'pastrami': 'cow',
  'corned beef': 'cow',
  'honey ham': 'pig',
  'nova lox': 'salmon'
}

In [50]:
lowercased = data['food'].str.lower()
lowercased
data['animal'] = lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [51]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

### Replacing Values

In [52]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [53]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [54]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [55]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [56]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

### Renaming Axis Indexes

In [57]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])

In [58]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [59]:
transform = lambda x: x[:4].upper()
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [60]:
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [61]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [62]:
data.rename(index={'OHIO': 'INDIANA'},
            columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [63]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

### Discretization and Binning

In [64]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [65]:
bins = [18, 25, 35, 60, 100]
cats = pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [66]:
cats.codes
cats.categories
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [67]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [68]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
pd.cut(ages, bins, labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [69]:
data = np.random.rand(20)
pd.cut(data, 4, precision=2)

[(0.75, 1.0], (-3.4e-05, 0.25], (0.25, 0.5], (0.25, 0.5], (-3.4e-05, 0.25], ..., (-3.4e-05, 0.25], (0.25, 0.5], (0.75, 1.0], (0.25, 0.5], (0.5, 0.75]]
Length: 20
Categories (4, interval[float64]): [(-3.4e-05, 0.25] < (0.25, 0.5] < (0.5, 0.75] < (0.75, 1.0]]

In [70]:
data = np.random.randn(1000)  # Normally distributed
cats = pd.qcut(data, 4)  # Cut into quartiles
cats
pd.value_counts(cats)

(0.566, 3.928]       250
(-0.0559, 0.566]     250
(-0.671, -0.0559]    250
(-3.4, -0.671]       250
dtype: int64

In [71]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(-0.0559, 1.246], (-1.191, -0.0559], (-0.0559, 1.246], (-1.191, -0.0559], (1.246, 3.928], ..., (-1.191, -0.0559], (-0.0559, 1.246], (-3.4, -1.191], (-0.0559, 1.246], (-0.0559, 1.246]]
Length: 1000
Categories (4, interval[float64]): [(-3.4, -1.191] < (-1.191, -0.0559] < (-0.0559, 1.246] < (1.246, 3.928]]

### Detecting and Filtering Outliers

In [81]:
data = pd.DataFrame(np.random.randn(1000, 4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.028099    -0.010860    -0.002484    -0.004215
std       0.967288     1.016312     0.993763     0.999893
min      -3.398085    -3.105636    -3.530912    -3.024110
25%      -0.694552    -0.688653    -0.708105    -0.664500
50%       0.024996     0.012128     0.035344     0.016752
75%       0.613988     0.669434     0.678529     0.671497
max       3.160760     3.144389     3.003284     3.897527

In [82]:
col = data[2]
col[np.abs(col) > 3]

109   -3.530912
870    3.003284
Name: 2, dtype: float64

In [83]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
37  -0.286215 -3.105636 -0.369009  0.131459
48   0.523960 -1.414637  0.123291 -3.024110
109  1.666106  0.691626 -3.530912 -0.576175
400  1.052036  1.490529 -0.928871  3.061029
476  0.622791  3.144389  0.391328  0.672451
741  0.172595 -0.923066 -1.554274  3.897527
760  3.160760 -0.718885 -1.716556  0.674845
769 -1.567338  0.706299  2.133070  3.048747
870 -0.334487 -1.361069  3.003284  2.151570
969 -3.398085 -0.349365  1.440938  0.074944

In [84]:
data[np.abs(data) > 3] = np.sign(data) * 3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.027861    -0.010898    -0.001956    -0.005199
std       0.965463     1.015557     0.992006     0.996378
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.694552    -0.688653    -0.708105    -0.664500
50%       0.024996     0.012128     0.035344     0.016752
75%       0.613988     0.669434     0.678529     0.671497
max       3.000000     3.000000     3.000000     3.000000

In [85]:
np.sign(data).head()

     0    1    2    3
0  1.0  1.0 -1.0 -1.0
1  1.0  1.0  1.0 -1.0
2  1.0  1.0  1.0  1.0
3  1.0 -1.0  1.0 -1.0
4  1.0  1.0 -1.0 -1.0

### Permutation and Random Sampling

In [86]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))
sampler = np.random.permutation(5)
sampler

array([4, 2, 0, 1, 3])

In [87]:
df
df.take(sampler)

    0   1   2   3
4  16  17  18  19
2   8   9  10  11
0   0   1   2   3
1   4   5   6   7
3  12  13  14  15

In [88]:
df.sample(n=3)

    0   1   2   3
0   0   1   2   3
2   8   9  10  11
3  12  13  14  15

In [89]:
choices = pd.Series([5, 7, -1, 6, 4])
draws = choices.sample(n=10, replace=True)
draws

1    7
1    7
0    5
3    6
0    5
1    7
1    7
0    5
2   -1
3    6
dtype: int64

### Computing Indicator/Dummy Variables

In [90]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                   'data1': range(6)})
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [91]:
dummies = pd.get_dummies(df['key'], prefix='key')
df_with_dummy = df[['data1']].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [92]:
mnames = ['movie_id', 'title', 'genres']
movies = pd.read_table('datasets/movielens/movies.dat', sep='::',
                       header=None, names=mnames)
movies[:10]

C:\Users\ejc_2\Anaconda3\lib\site-packages\ipykernel_launcher.py:3: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  This is separate from the ipykernel package so we can avoid doing imports until

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [93]:
all_genres = []
for x in movies.genres:
    all_genres.extend(x.split('|'))
genres = pd.unique(all_genres)

In [94]:
genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [95]:
zero_matrix = np.zeros((len(movies), len(genres)))
dummies = pd.DataFrame(zero_matrix, columns=genres)

In [96]:
gen = movies.genres[0]
gen.split('|')
dummies.columns.get_indexer(gen.split('|'))

array([0, 1, 2], dtype=int64)

In [97]:
for i, gen in enumerate(movies.genres):
    indices = dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i, indices] = 1

In [98]:
movies_windic = movies.join(dummies.add_prefix('Genre_'))
movies_windic.iloc[0]

movie_id                                       1
title                           Toy Story (1995)
genres               Animation|Children's|Comedy
Genre_Animation                                1
Genre_Children's                               1
Genre_Comedy                                   1
Genre_Adventure                                0
Genre_Fantasy                                  0
Genre_Romance                                  0
Genre_Drama                                    0
                                ...
Genre_Crime                                    0
Genre_Thriller                                 0
Genre_Horror                                   0
Genre_Sci-Fi                                   0
Genre_Documentary                              0
Genre_War                                      0
Genre_Musical                                  0
Genre_Mystery                                  0
Genre_Film-Noir                                0
Genre_Western                                  0
Name: 0, Length: 21, dtype: object

In [99]:
np.random.seed(12345)
values = np.random.rand(10)
values
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

## String Manipulation

### String Object Methods

In [100]:
val = 'a,b,  guido'
val.split(',')

['a', 'b', '  guido']

In [101]:
pieces = [x.strip() for x in val.split(',')]
pieces

['a', 'b', 'guido']

In [102]:
first, second, third = pieces
first + '::' + second + '::' + third

'a::b::guido'

In [103]:
'::'.join(pieces)

'a::b::guido'

In [104]:
'guido' in val
val.index(',')
val.find(':')

-1

In [105]:
val.index(':')

ValueError: substring not found

In [106]:
val.count(',')

2

In [107]:
val.replace(',', '::')
val.replace(',', '')

'ab  guido'

### Regular Expressions

In [108]:
import re
text = "foo    bar\t baz  \tqux"
re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

In [109]:
regex = re.compile('\s+')
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [110]:
regex.findall(text)

['    ', '\t ', '  \t']

In [111]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'

# re.IGNORECASE makes the regex case-insensitive
regex = re.compile(pattern, flags=re.IGNORECASE)

In [112]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [113]:
m = regex.search(text)
m
text[m.start():m.end()]

'dave@google.com'

In [114]:
print(regex.match(text))

None

In [115]:
print(regex.sub('REDACTED', text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [116]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'
regex = re.compile(pattern, flags=re.IGNORECASE)

In [117]:
m = regex.match('wesm@bright.net')
m.groups()

('wesm', 'bright', 'net')

In [118]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [119]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3', text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

### Vectorized String Functions in pandas

In [120]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com',
        'Rob': 'rob@gmail.com', 'Wes': np.nan}
data = pd.Series(data)
data
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [121]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [122]:
pattern
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [123]:
matches = data.str.match(pattern, flags=re.IGNORECASE)
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [124]:
matches.str.get(1)
matches.str[0]

Dave    NaN
Steve   NaN
Rob     NaN
Wes     NaN
dtype: float64

In [125]:
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object

In [127]:
pd.options.display.max_rows = PREVIOUS_MAX_ROWS

## Conclusion